Revit 2025 API
FittingAndAccessoryCalculationType Enumeration
 The MEP fitting and accessory pressure drop calculation type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FittingAndAccessoryCalculationType
Public Enumeration FittingAndAccessoryCalculationType
public enum class FittingAndAccessoryCalculationType
type FittingAndAccessoryCalculationType
Members
Member name | Value | Description
Undefined | 0 |  Undefined fitting and accessory pressure drop calculation type.
CalculatePressureDrop | 1 |  To calculate the pressure drop of the fitting and accessory.
CalculateDefaultSettings | 2 |  To calculate the default settings of the fitting and accessory.
ValidateCurrentSettings | 4 |  To validate the current settings of the fitting and accessory.
See Also
Reference
Autodesk.Revit.DB Namespace